year1 = [
    '3ОЕЗ1О01', # Математика 1
    '3ОЕЗ1О02', # Основи електротехнике 1
    '3ОЕЗ1О03', # Физика
    '3ОЕЗ1О04', # Увод у рачунарство
    '3ОЕЗ1О05', # Увод у инжењерство
    '3ОЕЗ2О01', # Математика 2
    '3ОЕЗ2О02', # Алгоритми и програмирање
    '3ОЕЗ2О03', # Основи електротехнике 2
    '3ОЕЗ2О04', # Електронске компоненте
    '3ОЕЗ2О05'  # Увод у електронику
]

year2 = [
    '3ОЕР3О01', # Дискретна математика 
    '3ОЕР3О02', # Базе података
    '3ОЕР3О03', # Објектно оријентисано програмирање
    '3ОЕР3О04', # Архитектура и организација рачунара 1
    '3ОЕР3А01', # Логичко пројектовање
    '3ОЕР3А02', # Дигитална електроника
    '3ОЕР4О01', # Објектно оријентисано пројектовање
    '3ОЕР4О02', # Структуре података
    '3ОЕР4О03', # Програмски језици
    '3ОЕР4О04', # Архитектура и организација рачунара 2
    '3ОЕР4А01', # Матрична израчунавања
    '3ОЕР4А02', # Теорија графова
    '3ОЕР4А03', # Нумерички алгоритми
    '3ОЕР4А04', # Вероватноћа и статистика
    '3ОЕР4А05'  # Геометријски методи и примене
]

year3 = [
    '3ОЕР5О01', # Енглески језик 1
    '3ОЕР5О02', # Оперативни системи
    '3ОЕР5О03', # Рачунарске мреже
    '3ОЕР5О04', # Информациони системи
    '3ОЕР5О05', # Web програмирање
    '3ОЕР5А01', # Увод у теорију игара
    '3ОЕР5А02', # Основи анализе сигнала и система
    '3ОЕР5А03', # Пројектоваje и анализа алгоритама
    '3ОЕР6О01', # Енглески језик 2
    '3ОЕР6О02', # Софтверско инжењерство
    '3ОЕР6О03', # Паралелни системи
    '3ОЕР6А01', # Интернет ствари
    '3ОЕР6А02', # Интеракција човек-рачунар
    '3ОЕР6А03', # Системи база података
    '3ОЕР6А04', # Развој веб и вишеплатформских апликација
    '3ОЕР6А05', # Развој мобилних апликација и сервиса
    '3ОЕР6А06'  # Системско програмирање
]

year4 = [ 
    '3ОЕР7О01', # Вештачка интелигенција
    '3ОЕР7О02', # Рачунарска графика
    '3ОЕР7О03', # Програмски преводиоци
    '3ОЕР7А01', # Пројектовање рачунарских мрежа
    '3ОЕР7А02', # Пројектовање рачунарског хардвера
    '3ОЕР7А03', # Заштита информација
    '3ОЕР7А04', # Напредне базе података
    '3ОЕР7А05', # Архитектура и пројектовање софтвера
    '3ОЕР7А06', # Тестирање и квалитет софтвера
    '3ОЕР7А07', # Технологије за подршку учењу
    '3ОЕР7А08', # Основи управљања системима
    '3ОЕР7А09', # Рачунарски вид
    '3ОЕР8О01', # Дистрибуирани системи
    '3ОЕР8А01', # Мултимедијални системи
    '3ОЕР8А02', # Информационе технологије и системи
    '3ОЕР8А03', # Интернет ствари и сервиса
    '3ОЕР8А04', # Мерни системи засновани на микрорачунарима
    '3ОЕР8А05', # Инжењерство података и знања
    '3ОЕР8А06', # Машинска интелигенција у логичким играма
    '3ОЕР8А07', # Претраживање информација
    '3ОЕР8А08', # Методи и системи за обраду сигнала
    '3ОЕР8А09', # Мобилни комуникациони системи
    '3ОЕР8Б01', # Управљање пројектима
    '3ОЕР8Б02', # Социјални, правни и етички аспекти информатике
    '3ОЕР8Б03'  # Пословне комуникације
]

def year(n):
	match n:
		case 1:
			return year1
		case 2:
			return year2
		case 3:
			return year3
		case 4:
			return year4
